buoyantPimpleFoam_timevaryingBC/fine_timevaryingCavityFoam/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p_rgh
    {
        solver           PCG;
	preconditioner   DIC;
        tolerance        1e-7;
        relTol           0.01;

        smoother         DICGaussSeidel;

    }

    "(U|h|k|epsilon|omega|R)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-8;
        relTol          0.1;
    }
    "rho.*"
    {
	solver          PCG;
	preconditioner  DIC;
	tolerance       0;
	relTol          0;
    }
    p_rghFinal
    {
	$p_rgh;
	relTol          0;
    }
    "(U|h|k|epsilon|omega|R)Final"
    {
	$U;
	relTol          0;
	maxIter         0;
    }

    Ii
    {
	solver		    GAMG;
	tolerance           1e-4;
	relTol              0;
	smoother            symGaussSeidel;
	cacheAgglomeration  true;
	nCellsInCoarsestLevel   10;
	agglomerator        faceAreaPair;
	mergeLevels         1;
	maxIter             5;
	nPreSweeps          0;
	nPostSweeps         1;
    }
}

SIMPLE
{
    momentumPredictor no;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;

    residualControl
    {
        p_rgh           1e-4;
        U               1e-4;
        h               1e-4;

        // possibly check turbulence fields
        "(k|epsilon|omega)" 1e-3;
    }
}

PIMPLE
{
    momentumPredictor no;
    nOuterCorrectors 1;
    nCorrectors     2;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       1e5;
}

relaxationFactors
{
    fields
    {
        rho             1.0;
        p_rgh           0.7;
    }
    equations
    {
        U               0.3;
        h               0.3;
        "(k|epsilon|omega)" 0.7;
    }
}


// ************************************************************************* //
